export default {
  errors: {
    assignmentExists: 'មានការផ្តល់ជូនសកម្មភាពដែលក្តាប់រួចហើយសម្រាប់គ្រូបង្ហាត់និងក្រុម',
    loadingFailed: 'បរាជ័យក្នុងការផ្ទុកទិន្នន័យ',
    savingFailed: 'បរាជ័យក្នុងការរក្សាទុកការផ្លាស់ប្តូរ',
    loadingPlayers: 'បរាជ័យក្នុងការផ្ទុកក្រុមហ៊ុន',
    savingResult: 'បរាជ័យក្នុងការរក្សាទុកលទ្ធផលការប្រកួតប្រជែង',
    loadingCoaches: 'បរាជ័យក្នុងការផ្ទុកគ្រូបង្ហាត់',
    loadingDivisions: 'បរាជ័យក្នុងការផ្ទុកផ្នែក',
    loadingPlayingStyles: 'បរាជ័យក្នុងការផ្ទុកលក្ខណៈរបៀបលេង',
    deletingFailed: 'បរាជ័យក្នុងការលុបធាតុ',
  },
  success: {
    created: '{itemType} ត្រូវបានបង្កើតដោយជោគជ័យ',
    updated: '{itemType} ត្រូវបានធ្វើឱ្យទាន់សម័យដោយជោគជ័យ',
    deleted: '{itemType} ត្រូវបានលុបដោយជោគជ័យ',
    playingStyleCreated: 'លក្ខណៈរបៀបលេងត្រូវបានបង្កើតដោយជោគជ័យ',
    playingStyleUpdated: 'លក្ខណៈរបៀបលេងត្រូវបានធ្វើឱ្យទាន់សម័យដោយជោគជ័យ',
  },
  confirmations: {
    deleteItem: 'តើលោកអ្នកច្បាស់ថាចង់លុប "{itemName}"?',
    deleteDivision: 'តើលោកអ្នកច្បាស់ថាចង់លុបផ្នែកនេះ?',
    deletePlayingStyle: 'តើលោកអ្នកច្បាស់ថាចង់លុបលក្ខណៈរបៀបលេងនេះ?',
  },
}
